Revit 2024 API
SynchronizeWithCentralOptions.SetRelinquishOptions Method
 Sets the options which govern whether or not to relinquish elements and workset types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetRelinquishOptions(
	RelinquishOptions relinquishOptions
)
Visual Basic
Public Sub SetRelinquishOptions ( _
	relinquishOptions As RelinquishOptions _
)
Visual C++
public:
void SetRelinquishOptions(
	RelinquishOptions^ relinquishOptions
)
Parameters
relinquishOptions
Type: Autodesk.Revit.DB.RelinquishOptions
 The options. If null, synchronize with central will relinquish the current user's ownership of all worksets and all elements.
See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace